[
	[
		"What does a nosey pepper do?",
		"Gets jalapeno business!"
	],

	[
		"What do you call a fake noodle?",
		"An Impasta"
	],

	[
		"What do you call an alligator in a vest?",
		"An Investigator"
	],

	[
		"What happens if you eat yeast and shoe polish?",
		"Every morning you'll rise and shine!"
	],

	[
		"What's the difference between a guitar and a fish?",
		"You can't tuna fish."
	],

	[
		"Did you hear about the race between the lettuce and the tomato?",
		"The lettuce was a \"head\" and the tomato was trying to \"ketchup\"!"
	],

	[
		"What is it called when a cat wins a dog show?",
		"A CAT-HAS-TROPHY!"
	],

	[
		"Why can't you give Elsa a balloon?",
		"Because she will Let it go."
	],

	[
		"What do you get from a pampered cow?",
		"Spoiled milk."
	],

	[
		"What do lawyers wear to court?",
		"Lawsuits!"
	],

	[
		"What gets wetter the more it dries?",
		"A towel."
	],

	[
		"What do you get if you cross a cat with a dark horse?",
		"Kitty Perry"
	],

	[
		"What did the pencile say to the other pencil?",
		"your looking sharp."
	],

	[
		"What did Bacon say to Tomato?",
		"Lettuce get together!"
	],

	[
		"What is the most hardworking part of the eye?",
		"the pupil"
	],

	[
		"How do you make a tissue dance?",
		"Put a little boogey in it!"
	],

	[
		"Why did the picture go to jail?",
		"Because it was framed."
	],

	[
		"What do you call security guards working outside Samsung shops?",
		"Guardians of the Galaxy."
	],

	[
		"What do you get when you cross fish and an elephant?",
		"Swimming trunks."
	],

	[
		"Where do bees go to the bathroom?",
		"At the BP station!"
	],

	[
		"What do you call a baby monkey?",
		"A Chimp off the old block."
	],

	[
		"Who earns a living driving their customers away?",
		"A taxi driver."
	],

	[
		"How do you shoot a killer bee?",
		"With a bee bee gun."
	],

	[
		"How do you drown a Hipster?",
		"In the mainstream."
	],

	[
		"How do you make holy water?",
		"Boil the hell out of it!"
	],

	[
		"What happened to the dog that swallowed a firefly?",
		"It barked with de-light!"
	],

	[
		"What stays in the corner and travels all over the world?",
		"A stamp."
	],

	[
		"Why did the computer go to the doctor?",
		"Because it had a virus!"
	],

	[
		"Why are frogs so happy?",
		"They eat whatever bugs them"
	],
	[
		"What do you get when you cross a cow and a duck?",
		"Milk and quackers!"
	],

	[
		"What did the leopard say after eating his owner?",
		"Man, that hit the \"spot.\""
	],

	[
		"What do you call a sleeping bull?",
		"A bulldozer!"
	],

	[
		"What is the tallest building in the world?",
		"The library! It has the most stories!"
	],

	[
		"What do you call a belt with a watch on it?",
		"A waist of time"
	],

	[
		"Why did the banana go to the Doctor?",
		"Because it was not peeling well"
	],

	[
		"Why is England the wettest country?",
		"Because the queen has reigned there for years!"
	],

	[
		"Why do fish live in salt water?",
		"Because pepper makes them sneeze!"
	],

	[
		"Why did the man put his money in the freezer?",
		"He wanted cold hard cash!"
	],

	[
		"What do you get when you cross a snowman with a vampire?",
		"Frostbite."
	],

	[
		"What is the best day to go to the beach?",
		"Sunday, of course!"
	],

	[
		"What bow can't be tied?",
		"A rainbow!"
	],

	[
		"What season is it when you are on a trampoline?",
		"Spring time."
	],

	[
		"Where did the computer go to dance?",
		"To a disc-o."
	],

	[
		"What has one head, one foot and four legs?",
		"A Bed"
	],

	[
		"What is the difference between a school teacher and a train?",
		"The teacher says spit your gum out and the train says \"chew chew chew\"."
	],

	[
		"Why did the birdie go to the hospital?",
		"To get a tweetment."
	],

	[
		"What do you call someone who is afraid of Santa?",
		"A Clausterphobic"
	],

	[
		"What sound do porcupines make when they kiss?",
		"Ouch"
	],

	[
		"Why was the guy looking for fast food on his friend?",
		"Because his friend said dinner is on me."
	],

	[
		"Why is a 2016 calendar more popular than a 2015 calendar?",
		"It has more dates."
	],

	[
		"Did you hear the joke about the roof?",
		"Never mind, it's over your head!"
	],

	[
		"What is brown and has a head and a tail but no legs?",
		"A penny."
	],

	[
		"Why didn't the skeleton go to the dance?",
		"Because he had no-body to go with."
	],

	[
		"How do crazy people go through the forest?",
		"They take the psycho path."
	],

	[
		"What three candies can you find in every school?",
		"Nerds, DumDums, and smarties."
	],

	[
		"Why are pirates called pirates?",
		"Cause they arrrrr."
	],

	[
		"What do prisoners use to call each other?",
		"Cell phones."
	],

	[
		"Where do snowmen keep their money?",
		"In snow banks."
	],

	[
		"What washes up on very small beaches?",
		"Microwaves!"
	],

	[
		"What goes through towns, up & over hills, but doesn't move?",
		"The road!"
	],

	[
		"Why was there thunder and lightning in the lab?",
		"The scientists were brainstorming!"
	],

	[
		"Why did Tony go out with a prune?",
		"Because he couldn't find a date!"
	],

	[
		"What did the little mountain say to the big mountain?",
		"Hi Cliff!"
	],

	[
		"What did Winnie The Pooh say to his agent?",
		"Show me the honey!"
	],

	[
		"What do you call a funny mountain?",
		"hill-arious"
	],

	[
		"What did the candle say to the other candle?",
		"I'm going out tonight."
	],

	[
		"Why couldn't the pirate play cards?",
		"Because he was sitting on the deck!"
	],

	[
		"What did the janitor say when he jumped out of the closet?",
		"(SUPPLIES!)"
	],

	[
		"Why did the traffic light turn red?",
		"You would too if you had to change in the middle of the street!"
	],

	[
		"What did one elevator say to the other elevator?",
		"I think I'm coming down with something!"
	],

	[
		"What do you say when you lose a wii game?",
		"I want a wii-match!"
	],

	[
		"What never asks questions but receives a lot of answers?",
		"the Telephone."
	],

	[
		"How do you make an Octupus laugh?",
		"With ten-tickles"
	],

	[
		"Why can't your nose be 12 inches long?",
		"Because then it would be a foot!"
	],

	[
		"What has four wheels and flies?",
		"A garbage truck!"
	],

	[
		"What starts with a P, ends with an E, and has a million letters in it?",
		"Post Office!"
	],

	[
		"What did the blanket say to the bed?",
		"Don't worry, I've got you covered!"
	],

	[
		"Why should you take a pencil to bed?",
		"To draw the curtains!"
	],

	[
		"How many books can you put in an empty backpack?",
		"One! After that its not empty!"
	],

	[
		"What kind of flower doesn't sleep at night?",
		"The Day-zzz"
	],

	[
		"Did you hear they're changing the flooring in daycare centers?",
		"They're calling it infant-tile!"
	],

	[
		"What kind of button won't unbutton?",
		"A bellybutton!"
	],

	[
		"What did the triangle say to the circle?",
		"Your pointless!"
	],

	[
		"Why do sea-gulls fly over the sea?",
		"Because if they flew over the bay they would be bagels!"
	],

	[
		"What dog keeps the best time?",
		"A watch dog."
	],

	[
		"What did the man say to the wall?",
		"One more crack like that and I'll plaster ya!"
	],

	[
		"Why did the tomato turn red?",
		"It saw the salad dressing!"
	],

	[
		"Why do girls scouts sell cookies?",
		"They wanna make a sweet first impression."
	],

	[
		"What did the grape do when it got stepped on?",
		"It let out a little wine!"
	],

	[
		"What kind of berry has a coloring book?",
		"A crayon-berry"
	],

	[
		"What did the judge say when the skunk walked in the court room?",
		"Odor in the court."
	],

	[
		"What did the fish say when he swam into the wall?",
		"Dam!"
	],

	[
		"Why don't skeletons fight each other?",
		"They don't have the guts."
	],

	[
		"What did the janitor say when he jumped out of the closet?",
		"SUPPLIES!"
	],

	[
		"Why did the scientist go to the tanning salon?",
		"Because he was a paleontologist."
	],

	[
		"What happened when a faucet, a tomato and lettuce were in a race?",
		"The lettuce was ahead, the faucet was running and the tomato was trying to ketchup."
	],

	[
		"Why was the student's report card wet?",
		"It was below C level!"
	],

	[
		"How many tickles does it take to make an octopus laugh?",
		"Tentacles."
	],

	[
		"What did the traffic light say to the car?",
		"Don't look, I'm changing."
	],

	[
		"What do you call cheese that is not yours?",
		"Nacho Cheese"
	],

	[
		"How do you find a Princess?",
		"You follow the foot Prince."
	],

	[
		"What streets do ghosts haunt?",
		"Dead ends!"
	],

	[
		"What did the penny say to the other penny?",
		"We make perfect cents."
	],

	[
		"Why did the man with one hand cross the road?",
		"To get to the second hand shop."
	],

	[
		"Why did the boy sprinkle sugar on his pillow before he went to sleep?",
		"So he could have sweet dreams."
	],

	[
		"Why did the robber take a bath?",
		"Because he wanted to make a clean getaway."
	],

	[
		"What happens if life gives you melons?",
		"Your dyslexic"
	],

	[
		"What music are balloons scared of?",
		"Pop music"
	],

	[
		"What did the judge say to the dentist?",
		"Do you swear to pull the tooth, the whole tooth and nothing but the tooth."
	],

	[
		"Why did the boy tiptoe past the medicine cabinet?",
		"He didn't want to wake the sleeping pills!"
	],

	[
		"What do you get when you cross a fridge with a radio?",
		"Cool Music."
	],

	[
		"What goes up when the rain comes down?",
		"An umbrella."
	],

	[
		"Why did the belt go to jail?",
		"Because it held up a pair of pants!"
	],

	[
		"What happens if life gives you melons?",
		"Your dyslexic"
	],

	[
		"What did the stamp say to the envelope?",
		"Stick with me and we will go places!"
	],

	[
		"What kind of lights did Noah use on the Ark?",
		"Flood lights!"
	],

	[
		"Why don't you see giraffes in elementary school?",
		"Because they're all in High School!"
	],

	[
		"Which is the longest word in the dictionary?",
		"\"Smiles\", because there is a mile between each \"s\"!"
	],

	[
		"Which month do soldiers hate most?",
		"The month of March!"
	],

	[
		"What did the painter say to the wall?",
		"One more crack like that and I'll plaster you!"
	],

	[
		"Why did the computer break up with the internet?",
		"There was no \"Connection\"."
	],

	[
		"Why do golfers wear two pairs of pants?",
		"In case they get a hole in one!"
	],

	[
		"Why can't you take a nap during a race?",
		"Because if you snooze, you loose!"
	],

	[
		"Why did Goofy put a clock under his desk?",
		"Because he wanted to work over-time!"
	],

	[
		"Why did Johnny throw the clock out of the window?",
		"Because he wanted to see time fly!"
	],

	[
		"What do you call a book that's about the brain?",
		"A mind reader."
	],

	[
		"When do you stop at green and go at red?",
		"When you're eating a watermelon!"
	],

	[
		"Why did God make only one Yogi Bear?",
		"Because when he tried to make a second one he made a Boo-Boo"
	],

	[
		"How did the farmer mend his pants?",
		"With cabbage patches!"
	],

	[
		"Why did the man lose his job at the orange juice factory?",
		"He couldn't concentrate!"
	],

	[
		"How do you repair a broken tomato?",
		"Tomato Paste!"
	],

	[
		"Why did the baby strawberry cry?",
		"Because his parents were in a jam!"
	],

	[
		"What was the Cat in the Hat looking for in the toilet?",
		"For thing one and thing two."
	],

	[
		"What did the hamburger name his daughter?",
		"Patty!"
	],

	[
		"What kind of egg did the bad chicken lay?",
		"A deviled egg!"
	],

	[
		"What kind of key opens the door on Thanksgiving?",
		"A turkey!"
	],

	[
		"Why did the cookie go to the hospital?",
		"He felt crummy!"
	],

	[
		"Why were the teacher's eyes crossed?",
		"She couldn't control her pupils!"
	],

	[
		"What do you call a guy who never farts in public?",
		"A private tutor."
	],

	[
		"What do you call a bear with no socks on?",
		"Bare-foot."
	],

	[
		"What can you serve but never eat?",
		"A volleyball."
	],

	[
		"What kind of shoes do all spies wear?",
		"Sneakers."
	],

	[
		"Why did the soccer player bring string to the game?",
		"So he could tie the score."
	],

	[
		"Why is a baseball team similar to a muffin?",
		"They both depend on the batter."
	],

	[
		"What did the alien say to the garden?",
		"Take me to your weeder."
	],

	[
		"Why do watermelons have fancy weddings?",
		"Because they cantaloupe."
	],

	[
		"Have you heard the joke about the butter?",
		"I better not tell you, it might spread."
	],

	[
		"How do baseball players stay cool?",
		"They sit next to their fans."
	],

	[
		"Why was the math book sad?",
		"Because it had too many problems."
	],

	[
		"What runs but doesn't get anywhere?",
		"A refrigerator."
	],

	[
		"What is an astronaut's favorite place on a computer?",
		"The Space bar!"
	],

	[
		"What exam do young witches have to pass?",
		"A spell-ing test!"
	],

	[
		"What do you call a sheep with no head and no legs?",
		"A cloud!"
	],

	[
		"Why did the boy eat his homework?",
		"Because his teacher said it was a piece of cake!"
	],

	[
		"Why is Basketball such a messy sport?",
		"Because you dribble on the floor!"
	],

	[
		"How do you communicate with a fish?",
		"Drop him a line!"
	],

	[
		"Where do sheep go to get haircuts?",
		"To the Baa Baa shop!"
	],

	[
		"What does a shark like to eat with peanut butter?",
		"Jellyfish!"
	],

	[
		"What do cats eat for breakfast?",
		"Mice Crispies!"
	],

	[
		"Who goes to the bathroom in the middle of a party?",
		"A party pooper."
	],

	[
		"Why can't a leopard hide?",
		"Because he's always spotted!"
	],

	[
		"What do you give a dog with a fever?",
		"Mustard, its the best thing for a hot dog!"
	],

	[
		"What do you get when you cross a cat with a lemon?",
		"A sour puss!"
	],

	[
		"Why do birds fly south for the winter?",
		"Its easier than walking!"
	],

	[
		"What did the M&M go to college?",
		"Because he wanted to be a Smarty."
	],

	[
		"What kind of key opens a banana?",
		"A monkey!"
	],

	[
		"How do you know that carrots are good for your eyesight?",
		"Have you ever seen a rabbit wearing glasses?"
	],

	[
		"Why does a hummingbird hum?",
		"It doesn't know the words!"
	],

	[
		"What do you call a house that likes food?",
		"a Condoment!"
	],

	[
		"Why are some fish at the bottom of the ocean?",
		"Because they dropped out of school!"
	],

	[
		"What do you call a pile of kittens",
		"a meowntain"
	],

	[
		"What goes up and down but doesn't move?",
		"The temperature!"
	],

	[
		"What happened to the wooden car with wooden wheels and wooden engine?",
		"it wooden go!"
	],

	[
		"Which weighs more, a ton of feathers or a ton of bricks?",
		"Neither, they both weigh a ton!"
	],

	[
		"What has one horn and gives milk",
		"A milk truck."
	],
	[
		"Did you hear about the party a little boy had for his sisters barbie dolls?",
		"It was a Barbie-Q."
	],

	[
		"Where do bulls get their messages?",
		"On a bull-etin board."
	],

	[
		"What do bulls do when they go shopping?",
		"They CHARGE!"
	],

	[
		"What runs but can't walk?",
		"The faucet!"
	],

	[
		"Whens the best time to go to the dentist?",
		"Tooth-hurty"
	],

	[
		"What kind of bed does a mermaid sleep in?",
		"A water bed!"
	],

	[
		"What kind of crackers do firemen like in their soup?",
		"Firecrackers!"
	],

	[
		"Why did the barber win the race?",
		"Because he took a short cut."
	],

	[
		"What's taken before you get it?",
		"Your picture."
	],

	[
		"What concert costs 45 cents?",
		"50 Cent featuring Nickleback."
	],

	[
		"Why did the tree go to the dentist?",
		"To get a root canal."
	],

	[
		"When I was young there was only 25 letters in the Alphabet?",
		"Nobody new why."
	],

	[
		"What is it called when a cat wins a dog show?",
		"A CAT-HAS-TROPHY!"
	],

	[
		"What can go up a chimney down, but can't go down a chimney up?",
		"An umbrella."
	],

	[
		"Why was the broom late?",
		"It over swept!"
	],

	[
		"Why didn't the 11 year old go to the pirate movie?",
		"because it was rated arrrrr What did the Super Nintendo say to the Sega Genesis? \"You know, everyone always tells me that I'm a bit better than you.\""
	],

	[
		"What's the difference between Ms. and Mrs.?",
		"Mr."
	],

	[
		"What word looks the same backwards and upside down?",
		"Swims"
	],

	[
		"Where does a tree store their stuff?",
		"In there Trunk!"
	],

	[
		"What did the nose say to the finger?",
		"Stop picking on me."
	],

	[
		"What did the tie say to the hat?",
		"You go on ahead and I'll hang around!"
	],

	[
		"Where does bad light go?",
		"PRISM!"
	],

	[
		"What did one plate say to the other?",
		"Dinners on me"
	],

	[
		"Who cleans the bottom of the ocean?",
		"A Mer-Maid"
	],

	[
		"Where do pencils go on vacation?",
		"Pennsylvania"
	],

	[
		"What is heavy forward but not backward?",
		"Ton."
	],

	[
		"What do you get when you plant kisses?",
		"Tu-lips (two-lips)"
	],

	[
		"What pet makes the loudest noise?",
		"A trum-pet!"
	],

	[
		"What do you call a rabbit with fleas?",
		"Bugs Bunny!"
	],

	[
		"Why did the girl bring lipstick and eye shadow to school?",
		"She had a make-up exam!"
	],

	[
		"What is a bubbles least favorite drink?",
		"Soda POP"
	],

	[
		"What did one eyeball say to the other eyeball?",
		"Between you and me something smells."
	],

	[
		"What stays on the ground but never gets dirty?",
		"Shadow."
	],

	[
		"Name a city where no one goes?",
		"Electricity"
	],

	[
		"What four letters will frighten a burglar?",
		"O I C U"
	],

	[
		"What's the difference between a cat and a frog?",
		"A Cat has nine lives but a Frog croaks every night!"
	],

	[
		"Why can you never trust atoms?",
		"They make up everything!"
	],

	[
		"Where does bad light go?",
		"To prism!"
	],

	[
		"I can run but not walk, have a mouth but can't talk, and a bed, but I do not sleep. What am I?",
		"A River."
	]
]
